www/note/swap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>swap</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="swap"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-01 23:33:56 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">swap</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 swap</a>
<ul>
<li><a href="#sec-1-1">1.1 ozzie</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 overview</a></li>
<li><a href="#sec-1-1-2">1.1.2 deployment</a></li>
<li><a href="#sec-1-1-3">1.1.3 workflow</a></li>
<li><a href="#sec-1-1-4">1.1.4 coordinator</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 java</a></li>
<li><a href="#sec-1-3">1.3 hadoop</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> swap</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> ozzie</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> overview</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>一些链接：
</p><ul>
<li><a href="http://www.infoq.com/cn/articles/introductionOozie">http://www.infoq.com/cn/articles/introductionOozie</a> oozie简介
</li>
<li><a href="http://incubator.apache.org/oozie/">http://incubator.apache.org/oozie/</a> homepage
</li>
<li><a href="http://incubator.apache.org/oozie/overview.html">http://incubator.apache.org/oozie/overview.html</a> oozie overview
</li>
<li><a href="http://incubator.apache.org/oozie/map-reduce-cookbook.html">http://incubator.apache.org/oozie/map-reduce-cookbook.html</a> oozie简单地跑一个mapreduce
</li>
<li><a href="http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/index.html">http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/index.html</a> oozie文档
<ul>
<li>workflow <a href="http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/WorkflowFunctionalSpec.html">http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/WorkflowFunctionalSpec.html</a>
</li>
<li>coordinator <a href="http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/CoordinatorFunctionalSpec.html">http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/CoordinatorFunctionalSpec.html</a>
</li>
<li>bundle <a href="http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/BundleFunctionalSpec.html">http://incubator.apache.org/oozie/docs/3.2.0-incubating/docs/BundleFunctionalSpec.html</a>
</li>
</ul>

</li>
</ul>


<p>
oozie工作方式也是启动一个mapper任务（这个任务启动真正任务）放在cluster上面运行。大致上来看的话需要几个文件：
</p><ul>
<li>workflow.xml ozzie读取它来知道每个任务DAG如何并且失败以及成功之后如何处理。需要提交到hdfs上面。
</li>
<li>coordinator.xml 如果是coordinator模式的话，还需要这个文件。需要提交到hdfs上面。
</li>
<li>job.properties 这个用来存放一些任务相关的参数等。这个部分其实可以和workflow.xml放在一起，但是分离出来的话可以方便分离。本地使用。
</li>
<li>lib 目录下面存放启动启动需要的库文件比如jar或者是so等。需要提交到hdfs上面。
</li>
</ul>

<p>然后我们需要将这写文件提交到hdfs上面，然后使用ozzie启动。ozzie会提供一个回调url，启动的任务应该会定时向这些url进行汇报状态（回调），或者是
ozzie去查询这些任务状态（这些任务应该也会内置httpserver）。（应该是通过回调方式完成 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a5_Oozie_Notifications">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a5_Oozie_Notifications</a> ，
并且这里注意到oozie只是使用best-effort方式来做notification）。值得一提的就是oozie也有local-mode方便调试和测试。
</p>
<p>
oozie执行分为三种模式：
</p><ul>
<li>workflow. 这种方式非常简单，就是定义DAG来执行。
</li>
<li>coordinator. workflow缺点非常明显，就是没有办法定时触发或者是条件触发。coordinator可以完成这个需求。coordinator构建在workflow工作方式上面，可以定时运行也可以触发运行。
</li>
</ul>

<p>触发条件非常巧妙，提供一个叫做synchronous dataset的数据集。这个数据集其实就是一个url（文件系统url），不过这个url通过时间来进行区分。比如hdfs://foo:9000/usr/logs/2009/04/15/23/30.
</p><ul>
<li>bundle. bundle的作用就是将多个coordinator管理起来。这样我们只需要提供一个bundle提交即可。然后可以start/stop/suspend/resume任何coordinator.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> deployment</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>设置job.properties里面地址
</li>
<li>修改core-site.xml里面的key-value，包括hadoop.proxyuser.&lt;name&gt;.host/group
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> workflow</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>对于workflow来说，最主要关注下面几个部分：
</p><ul>
<li>node
<ul>
<li>control flow node // 控制流节点，决定这个DAG。
</li>
<li>action node // 动作节点。TODO（dirlt）：这里不是很明白streaming和pipe方式之间的差别。
</li>
</ul>

</li>
<li>parameterization // 参数化，可以获得很多外部状态变量并且进行计算判断。
</li>
</ul>

<p>下面是一些具体细节：
</p><ul>
<li>action有两个状态ok/error <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a3.2.1.3_Actions_Have_2_Transitions_ok_and_error">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a3.2.1.3_Actions_Have_2_Transitions_ok_and_error</a> 
<ul>
<li>对于error而言的话，需要提供error-code以及error-message，这样可以方便下面的决策。
</li>
</ul>

</li>
<li>action如何进行recovery的 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a3.2.1.4_Action_Recovery">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a3.2.1.4_Action_Recovery</a>
</li>
<li>workflow job生命周期（lift cycle） <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a9_Workflow_Jobs_Lifecycle">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a9_Workflow_Jobs_Lifecycle</a>
<ul>
<li>prepare
</li>
<li>running
</li>
<li>suspend
</li>
<li>succeed
</li>
<li>killed
</li>
<li>failed
</li>
</ul>

</li>
<li>rerun可以用来重新提交任务 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a10_Workflow_Jobs_Recovery_re-run">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a10_Workflow_Jobs_Recovery_re-run</a>
<ul>
<li>用户自己标记哪些任务需要skip
</li>
<li>如果这个任务之前没有complete但是却被skip的话，那么fail
</li>
<li>这个job和原来的job使用同一个jobID
</li>
<li>TODO（dirlt）；文档似乎没有写明如何具体提交！
</li>
</ul>

</li>
<li>提供了webservice API接口来控制 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a11_Oozie_Web_Services_API_V0">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a11_Oozie_Web_Services_API_V0</a>
</li>
<li>没有提供优先级控制的方式 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a16_Workflow_Jobs_Priority">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/WorkflowFunctionalSpec.html#a16_Workflow_Jobs_Priority</a>
<ul>
<li>Any prioritization of jobs in the remote systems is outside of the scope of Oozie.
</li>
</ul>

</li>
</ul>


<p>
这里给出一个例子配置文件作为说明（这个例子就是oozie homepage里面run example使用的例子 examples/app/map-reduce）。首先是workflow.xml
</p>


<pre class="src src-XML">&lt;!--
  Copyright (c) 2010 Yahoo! Inc. All rights reserved.
  Licensed under the Apache License, Version 2.0 (the <span style="color: #ffff00;">"License"</span>);
  you may not use this file except in compliance with the License.
  You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an <span style="color: #ffff00;">"AS IS"</span> BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License. See accompanying LICENSE file.
--&gt;
&lt;workflow-app xmlns=<span style="color: #ffff00;">"uri:oozie:workflow:0.1"</span> name=<span style="color: #ffff00;">"map-reduce-wf"</span>&gt;
    &lt;start to=<span style="color: #ffff00;">"mr-node"</span>/&gt;
    &lt;action name=<span style="color: #ffff00;">"mr-node"</span>&gt;
        &lt;map-reduce&gt;
            &lt;job-tracker&gt;${jobTracker}&lt;/job-tracker&gt;
            &lt;name-node&gt;${nameNode}&lt;/name-node&gt;
            &lt;prepare&gt;
                &lt;delete path=<span style="color: #ffff00;">"${nameNode}/user/${wf:user()}/${examplesRoot}/output-data/${outputDir}"</span>/&gt;
            &lt;/prepare&gt;
            &lt;configuration&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.job.queue.name&lt;/name&gt;
                    &lt;value&gt;${queueName}&lt;/value&gt;
                &lt;/property&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.mapper.class&lt;/name&gt;
                    &lt;value&gt;org.apache.oozie.example.SampleMapper&lt;/value&gt;
                &lt;/property&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.reducer.class&lt;/name&gt;
                    &lt;value&gt;org.apache.oozie.example.SampleReducer&lt;/value&gt;
                &lt;/property&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.map.tasks&lt;/name&gt;
                    &lt;value&gt;1&lt;/value&gt;
                &lt;/property&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.input.dir&lt;/name&gt;
                    &lt;value&gt;/user/${wf:user()}/${examplesRoot}/input-data/text&lt;/value&gt;
                &lt;/property&gt;
                &lt;property&gt;
                    &lt;name&gt;mapred.output.dir&lt;/name&gt;
                    &lt;value&gt;/user/${wf:user()}/${examplesRoot}/output-data/${outputDir}&lt;/value&gt;
                &lt;/property&gt;
            &lt;/configuration&gt;
        &lt;/map-reduce&gt;
        &lt;ok to=<span style="color: #ffff00;">"end"</span>/&gt;
        &lt;error to=<span style="color: #ffff00;">"fail"</span>/&gt;
    &lt;/action&gt;
    &lt;kill name=<span style="color: #ffff00;">"fail"</span>&gt;
        &lt;message&gt;Map/Reduce failed, error message[${wf:errorMessage(wf:lastErrorNode())}]&lt;/message&gt;
    &lt;/kill&gt;
    &lt;end name=<span style="color: #ffff00;">"end"</span>/&gt;
&lt;/workflow-app&gt;
</pre>

<p>
这是一个map-reduce的action，在prepare阶段将原来的输出文件删除掉，在configuration部分配置了一些参数。${}部分就是parameterization，
这些参数内容都是从job.properties里面得到的。下面看看这个job.properties是如何定义的
</p>



<pre class="example">nameNode=hdfs://localhost:9000
jobTracker=localhost:9001
queueName=default
examplesRoot=examples

oozie.wf.application.path=${nameNode}/user/${user.name}/${examplesRoot}/apps/map-reduce
outputDir=map-reduce

</pre>


<p>
接着使用 oozie job -oozie <a href="http://localhost:11000/oozie/">http://localhost:11000/oozie/</a> -config job.properties -run 就可以进行提交。提交完成之后就可以得到一个jobID。
接着使用 oozie job -oozie <a href="http://localhost:11000/oozie/">http://localhost:11000/oozie/</a> -kill ${jobID} 就可以用来将这个job kill掉。
<a href="http://localhost:11000/oozie/">http://localhost:11000/oozie/</a> 也提供了webconsole的方式来察看所有提交的job运行状况（在workflow jobs这个tab里面）
</p>
<p>
为了方便我编写了下面几个脚本：
</p><ul>
<li>submit
</li>
<li>cancel
</li>
<li>update
</li>
</ul>




<pre class="src src-Shell">#!/bin/bash
oozie job -oozie http://localhost:11000/oozie/ -config job.properties -run

#!/bin/bash
oozie job -oozie http://localhost:11000/oozie/ -kill $@

#!/bin/bash
hadoop fs -rm /user/dirlt/examples/apps/map-reduce/workflow.xml
hadoop fs -put workflow.xml /user/dirlt/examples/apps/map-reduce/

</pre>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> coordinator</h4>
<div class="outline-text-4" id="text-1-1-4">

<p>对于coordinator来说，有几个比较重要的概念：
</p><ul>
<li>time &amp; frequency // 指定触发时间以及触发频率等 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a4._Datetime_Frequency_and_Time-Period_Representation">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a4._Datetime_Frequency_and_Time-Period_Representation</a>
</li>
<li>sync dataset // 可以用来指定各个workflow之间的相互数据依赖 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a5.1._Synchronous_Datasets">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a5.1._Synchronous_Datasets</a>
<ul>
<li>input events
</li>
<li>output events
</li>
</ul>

</li>
<li>coord application 
<ul>
<li>coord job // app的instance <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.2._Coordinator_Job">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.2._Coordinator_Job</a>
<ul>
<li>timeout // 对于一个action被调度到的超时时间
</li>
<li>concurrency // 可以执行的action的并发度
</li>
<li>execution strategy // 对于所有可执行action的执行策略 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.6._Coordinator_Action_Execution_Policies">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.6._Coordinator_Action_Execution_Policies</a>
</li>
</ul>

</li>
<li>coord action // 一个job里面包含的action。这里所谓的action会包含很多的workflow,甚至这些workflow都是recurrent的。 <a href="http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.3._Coordinator_Action">http://z/home/dirlt/utils/oozie-2.3.2-cdh3u3/docs/CoordinatorFunctionalSpec.html#a6.1.3._Coordinator_Action</a>
<ul>
<li>每个action到固定时刻都会被create，即使这些action还不需要执行。
</li>
<li>action应该执行时刻被成为nominal time
</li>
<li>create也被成为materialization（物化）
</li>
</ul>

</li>
</ul>

</li>
</ul>

<p>sync dataset通常是一个hdfs uri，你可以让uri里面指定date以及time来对应到每一个具体的任务。一旦某个任务完成的话，那么这个hdfs uri就会建立，
并且在先面会存在一个_SUCCESS的文件（当然你也可以指定其他文件名，如果没有指定的话那么就以目录是否存在作为依据），来表示任务完成。各个任务之间可以通过这种方式来做数据流之间的依赖。
</p>
<p>
NOTE（dirlt）：关于coordinator的文档非常少，而且使用起来有诸多不便。比如时区设置难以设置正确，以及在webconsole下面不方便察看killed掉workflow的原因。
另外如果想做一些定制化执行策略的话，还需要通过使用一些workaround的方法才可以OK。
</p>
<p>
下面看一个使用coordinator的例子（这个例子在 examples/apps/aggregator/ 目录下面）。我们现在需要三个文件
</p><ul>
<li>coordinator.xml
</li>
<li>workflow.xml
</li>
<li>job.properties
</li>
</ul>

<p>和workflow工作方式非常类似，需要.xmlf放到hdfs上面，而job.properties在本地提供一些参数。先看看coordinator.xml
</p>



<pre class="src src-XML">&lt;coordinator-app name=<span style="color: #ffff00;">"coord"</span> frequency=<span style="color: #ffff00;">"${coord:minutes(1)}"</span>
                 start=<span style="color: #ffff00;">"2012-08-01T16:30Z"</span> end=<span style="color: #ffff00;">"2020-01-04T08:00Z"</span> timezone=<span style="color: #ffff00;">"${tz}"</span>
                 xmlns=<span style="color: #ffff00;">"uri:oozie:coordinator:0.1"</span>&gt;
  &lt;controls&gt;
    &lt;timeout&gt;-1&lt;/timeout&gt;
    &lt;concurrency&gt;2&lt;/concurrency&gt;
    &lt;execution&gt;FIFO&lt;/execution&gt;
  &lt;/controls&gt;     

  &lt;datasets&gt;
    &lt;dataset name=<span style="color: #ffff00;">"din"</span> frequency=<span style="color: #ffff00;">"${coord:minutes(1)}"</span>
             initial-instance=<span style="color: #ffff00;">"2012-08-01T16:30Z"</span> timezone=<span style="color: #ffff00;">"${tz}"</span>&gt;
      &lt;uri-template&gt;${appPath}/input-data/${YEAR}/${MONTH}/${DAY}/${HOUR}/${MINUTE}&lt;/uri-template&gt;
    &lt;/dataset&gt;
    &lt;dataset name=<span style="color: #ffff00;">"dout"</span> frequency=<span style="color: #ffff00;">"${coord:minutes(1)}"</span>
             initial-instance=<span style="color: #ffff00;">"2012-08-01T16:30Z"</span> timezone=<span style="color: #ffff00;">"${tz}"</span>&gt;
      &lt;uri-template&gt;${appPath}/output-data/${YEAR}/${MONTH}/${DAY}/${HOUR}/${MINUTE}&lt;/uri-template&gt;
    &lt;/dataset&gt;
  &lt;/datasets&gt;

  &lt;input-events&gt;
    &lt;data-in name=<span style="color: #ffff00;">"input"</span> dataset=<span style="color: #ffff00;">"din"</span>&gt;
      &lt;instance&gt;${coord:current(0)}&lt;/instance&gt;
    &lt;/data-in&gt;
  &lt;/input-events&gt;
  &lt;output-events&gt;
    &lt;data-out name=<span style="color: #ffff00;">"output"</span> dataset=<span style="color: #ffff00;">"dout"</span>&gt;
      &lt;instance&gt;${coord:current(0)}&lt;/instance&gt;
    &lt;/data-out&gt;
  &lt;/output-events&gt;

  &lt;action&gt;
    &lt;workflow&gt;
      &lt;app-path&gt;${appPath}&lt;/app-path&gt;
      &lt;configuration&gt;
        &lt;property&gt;
          &lt;name&gt;jobTracker&lt;/name&gt;
          &lt;value&gt;${jobTracker}&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
          &lt;name&gt;nameNode&lt;/name&gt;
          &lt;value&gt;${nameNode}&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
          &lt;name&gt;queueName&lt;/name&gt;
          &lt;value&gt;${queueName}&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
          &lt;name&gt;inputData&lt;/name&gt;
          &lt;value&gt;${coord:dataIn('input')}&lt;/value&gt;
        &lt;/property&gt;
        &lt;property&gt;
          &lt;name&gt;outputData&lt;/name&gt;
          &lt;value&gt;${coord:dataOut('output')}&lt;/value&gt;
        &lt;/property&gt;        
      &lt;/configuration&gt;
    &lt;/workflow&gt;
  &lt;/action&gt;
&lt;/coordinator-app&gt;
</pre>


<p>
其中appPath就是我们之前提到的workflow目录。所以可见coordinator是架在workflow上面的。至于workflow.xml不需要做任何修改。
同样job.properties里面定义也是参数化的内容。不过需要注意的一点就是，这里必须指定oozie.coord.application.path而不是
oozie.wf.application.path.
</p>



<pre class="example">nameNode=hdfs://localhost:9000
jobTracker=localhost:9001
queueName=default
examplesRoot=examples
tz=Asia/Shanghai
appPath=${nameNode}/user/${user.name}/${examplesRoot}/apps/map-reduce

oozie.coord.application.path=${nameNode}/user/${user.name}/${examplesRoot}/apps/map-reduce

</pre>


<p>
运行和取消方式都和之前的workflow方式没有任何差别。至于察看webconsole内容在coordinator jobs这个tab里面。
比较郁闷的就是，不能够察看每一个action具体的情况，这点是非常不利于调试的。
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> java</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>日志,log4j
</li>
<li>泛型 
</li>
<li>容器 
</li>
<li>多线程
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> hadoop</h3>
<div class="outline-text-3" id="text-1-3">

<p>存在两套API，现在比较推荐使用mapreduce而非mapred名字空间下面的类，现在mapreduce下面的类使用起来更加简单。
</p>
<p>
hbase支持increment <a href="http://hbase.apache.org/apidocs/org/apache/hadoop/hbase/client/Increment.html">http://hbase.apache.org/apidocs/org/apache/hadoop/hbase/client/Increment.html</a>
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-01 23:33:56 CST</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
